<?php
namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PermissionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::select("INSERT INTO `admin_permissions`(`id`, `name`, `icon`, `path`, `url`, `status`, `created_at`, `method`, `updated_at`, `p_id`, `hidden`, `is_menu`, `title`, `deleted_at`) VALUES (1, '系统管理', 'fa fa-steam-square', '/admin', '/admin', 1, '2021-02-28 11:40:29', '*', '2022-07-13 16:11:06', 0, 1, 1, '系统管理', '2022-07-13 16:11:06'),
(2, '权限管理', 'fa fa-pencil-square', '/permission', '/permission', 1, '2021-02-28 11:42:17', '*', '2021-02-28 12:12:08', 1, 1, 1, '权限管理', NULL),
(3, '角色管理', 'fa fa-user-secret', '/role', '/role', 1, '2021-02-28 11:43:15', '*', '2022-06-01 20:07:37', 1, 1, 1, '角色管理', NULL),
(4, '用户管理', 'fa fa-users', '/user', '/user', 1, '2021-02-28 11:43:59', '*', '2021-02-28 12:12:22', 1, 1, 1, '用户管理', NULL),
(5, '系统日志', 'fa fa-location-arrow', '/log', '/log', 1, '2021-03-01 07:02:04', '*', '2021-03-01 07:02:04', 1, 1, 1, '系统日志', NULL),
(6, '系统', NULL, NULL, 'api/admin', 1, '2021-03-03 02:08:23', '*', '2021-03-03 11:56:06', 0, 1, 0, '系统', NULL),
(7, '日志列表', NULL, NULL, 'api/admin/log', 1, '2021-03-03 02:19:14', 'GET', '2021-03-03 14:06:12', 6, 1, 0, '日志列表', NULL),
(8, '用户列表', NULL, NULL, 'api/admin/users', 1, '2021-03-03 05:33:21', 'GET', '2021-03-03 14:06:24', 6, 1, 0, '用户列表', NULL),
(9, '日志删除', NULL, NULL, 'api/admin/log/{id}', 1, '2021-03-03 05:44:09', 'DELETE', '2021-03-03 13:46:51', 6, 1, 0, '日志删除', NULL),
(10, '添加用户', NULL, NULL, 'api/admin/users', 1, '2021-03-03 06:03:04', 'POST', '2021-03-03 14:06:52', 6, 1, 0, '添加用户', NULL),
(11, '更新用户', NULL, NULL, 'api/admin/users/{id}', 1, '2021-03-03 06:05:41', 'PUT', '2021-03-03 06:05:41', 6, 1, 0, '更新用户', NULL),
(12, '权限列表', 'fa fa-user-secret', '*', '/api/admin/permissions', 1, '2021-03-13 12:51:32', '*', '2021-03-13 20:52:19', 6, 1, 1, '权限列表', '2021-03-13 20:52:19'),
(13, '权限列表', NULL, NULL, 'api/admin/permissions', 1, '2021-03-13 12:52:32', 'GET', '2021-03-13 20:56:41', 6, 1, 0, '权限列表', NULL),
(14, '角色列表', NULL, NULL, 'api/admin/roles', 1, '2021-03-13 12:53:58', 'GET', '2021-03-13 20:57:25', 6, 1, 0, '角色列表', NULL),
(15, '测试', 'fa fa-slack', '/test', '/api/test', 1, '2021-05-27 05:50:58', '*', '2021-05-27 14:17:08', 0, 1, 1, '测试', '2021-05-27 14:17:08'),
(16, '子节点', 'fa fa-italic', '/test/z-test', '/*', 1, '2021-05-27 05:51:45', '*', '2021-05-27 13:53:03', 15, 1, 1, '子节点', NULL),
(17, '测试', 'fa fa-slack', '/test-1', '*', 1, '2021-05-27 05:53:33', '*', '2021-05-27 13:55:37', 0, 1, 1, '测试', '2021-05-27 13:55:37'),
(18, '测试菜单', 'fa fa-arrows-alt', '/test', '/test', 1, '2021-05-27 06:18:06', '*', '2021-06-03 10:21:21', 0, 1, 1, '测试菜单', '2021-06-03 10:21:21'),
(19, '测试子菜单', 'fa fa-video-camera', '/z-test', '/z-test', 1, '2021-05-27 06:19:01', '*', '2021-05-27 14:32:51', 18, 1, 1, '测试子菜单', NULL),
(20, '测试子菜单2', 'fa fa-arrows-alt', '/z-test1', '/z-test1', 1, '2021-05-27 06:22:10', '*', '2021-05-27 14:24:06', 18, 1, 1, '测试子菜单2', '2021-05-27 14:24:06'),
(21, '系统信息', 'fa fa-sun-o', '/system', '/system', 1, '2021-05-31 08:03:30', '*', '2021-05-31 08:03:30', 1, 1, 1, '系统信息', NULL),
(22, '系统终端', 'fa fa-terminal', '/terminal', '/terminal', 1, '2021-06-01 02:05:37', '*', '2021-06-01 02:05:37', 1, 1, 1, '系统终端', NULL),
(23, '系统工具', 'fa fa-steam', '/systemTools', '/systemTools', 1, '2021-06-03 02:12:13', '*', '2021-06-03 10:14:45', 24, 1, 1, '系统工具', NULL),
(24, '系统工具', 'fa fa-dedent', '/Tools', '/Tools', 1, '2021-06-03 02:14:29', '*', '2021-06-03 10:33:31', 0, 1, 1, '系统工具', '2021-06-03 10:33:31'),
(25, '代码生成', 'fa fa-file-code-o', '/code', '/code', 1, '2021-06-03 02:15:20', '*', '2021-06-03 13:30:43', 1, 1, 1, '代码生成', '2021-06-03 13:30:43'),
(26, '新增权限', NULL, '/permission', '/permission', 1, '2022-06-28 16:00:37', '*', '2022-06-28 16:00:37', 2, 1, 1, '新增权限', NULL)");
    }
}
